<?php

use Illuminate\Database\Seeder;

class QuestionsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        
        $themes =['Загальні знання', 'Фільми', 'Спортивні', 'Наука', 'Музика'];
        $tasks = [ 0 => ['Як називається найбільша технологічна компанія в Південній Кореї?',
                    'Який метал був відкритий Гансом Крістіаном Ерстедом у 1825 році?',
                    'Яка столиця Португалії?',
                    'Хто був прем\'єр-міністром Великобританії з 1841 по 1846 рік?',
                    'Що таке хімічний символ для срібла?',
                    'Хто винайшов Котячі очі в 1934 році для поліпшення безпеки дорожнього руху?',
                    'Яка найменша у світі птаха?',
                    'Якою візитною карткою Аль Капоне було його заняття?',
                    'У якому році "Титанік" затонув в Атлантичному океані 15 квітня, в плаванні з Саутгемптона?',
                    'Хто винайшов консервну банку для консервування їжі в 1810 році?'],
                    1 => ['У якому році було вперше випущено Хрещеного батька?',
                    'Який актор здобув найкращого актора «Оскар» за фільми «Філадельфія» (1993) та «Форест Гамп» (1994)?',
                    'Яка актриса зіграла Мері Поппінс у фільмі 1964 року Мері Поппінс?',
                    'Яка новозеландська режисерка зняла ці фільми - In the Cut (2003), The Water Diary (2006) та Bright Star (2009)?',
                    'Який актор забезпечив голос герою Немо у фільмі 2003 року в пошуку Немо?',
                    'Про якого ув\'язненого, якого охрестили "найжорстокішим в\'язнем у Великобританії", було предметом фільму 2009 року?',
                    'Цей фільм 2008 року в головній ролі Крітіана Бейл: "Я вірю, що все, що не вбиває вас, просто робить вас ... чужими".',
                    'У якій середземноморській країні народився режисер Френк Капра, відомий фільмом "Це прекрасне життя"?',
                    'Який британський актор відіграв роль Лі Різдва разом із Сільвестром Сталлоне у фільмі "Витратні"?',
                    'Який американський актор знявся разом з Кім Бассінгер у фільмі 9½ тижні?'],
                    2 => ['Де американська команда з бейсболу Tampa Bay Rays проводить свої домашні ігри?',
                    'Хто був BBC «Спортивна особистість року» у 2001 році?',
                    'Скільки гравців у команді з водного поло?',
                    'Яка країна виграла Кубок світу в Іспанії 1982 року, перемігши Західну Німеччину 3-1?',
                    'Який тенісист виграв відкритий чемпіонат Австралії 2012 року, перемігши Марію Шарапову 6-3, 6-0?',
                    'Яку спортивну гру винайшов Джеймс Нейсміт у 1891 році?',
                    'Скільки гравців є в олімпійській команді з керлінгу?',
                    'Збірна бейсболу вищої ліги американського міста названа на честь кардиналів?',
                    'Який хорт виграв дербі у 2000 та 2001 роках?',
                    'Канадець Коннор МакДавід - зірка, що розвивається, в якому виді спорту?'],
                    3 => ['Хто скинув молот і перо на Місяць, щоб продемонструвати, що без повітря вони падають з однаковою швидкістю?',
                    'Якби Земля була зроблена в чорну діру, який би був діаметр її горизонту подій?',
                    'Якби ви зробили один крок щосекунди у чоботах із семи ліг, яка би ваша швидкість була в милях на годину?',
                    'Що найдальше ви можете бачити неозброєним оком?',
                    'На найближчу тисячу, скільки волосинок на типовій людській голові?',
                    'Хто винайшов грамофон?',
                    'Скільки років пройде космічний корабель, запущений із Землі, щоб прибути на планету Плутон?',
                    'Скільки води на Землі на одну людину?',
                    'Якби ви могли обробити мільярд атомів в секунду, скільки років знадобиться телепортувати типову людину?',
                    'До найближчого 1 відсотка, який відсоток маси Сонячної системи знаходиться на Сонці?'],
                    4 => [' У якому році "Бітлз" вперше поїхав до США?',
                    'Хто був співаком з поп-групи Slade 1970-х?',
                    'Які 1960-ті роки американська поп-група створила «сурфін звук»?',
                    'Як називався перший запис Адель?',
                    '"Future Nostalgia", що містить сингл "Don\'t Start Now" - це другий студійний альбом, з якого англійська співачка?',
                    'Як звуть гурт з такими учасниками: Джон Дікон, Брайан Мей, Фредді Мерк\'юрі, Роджер Тейлор?',
                    'Який співак був відомий серед іншого під назвою "Король поп-музики" та "Рукавичка"?',
                    'Яка американська поп-зірка мала успіх у чартах 2015 року із синглами "Sorry" та "Love Yourself"?',
                    '"Втрата моєї релігії" була хітом для якої альтернативної рок-групи в 1991 році?',
                    'У якій пісні є такі тексти: «Раптом я не половина людини, якою я був раніше. / На мені висить тінь. ”?']
        ];
                                         
        $k=0;
        for ($i = 0; $i < 5; $i++) {
            for ($j = 0; $j < 10; $j++) {
        
            DB::table('questions')->insert([
                'title' => $themes[$k],
                'question' => $tasks[$k][$j]
            ]);
        }
        $k++;
    }
    }
}
